app/controllers/articles_controller.rb

  def create
    @blog_item = Article.new(security_params)
    #binding.pry

    if @blog_item.save
---
INSERT INTO "articles" ("created_at", "text", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-05-16 18:15:22.221857"], ["text", "asdadsaaxx"], ["title", "asease"], ["updated_at", "2014-05-16 18:15:22.221857"]]

  def show
    @blog_item = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 8]]

  def edit
    @blog_item = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @blog_item = Article.find(params[:id])

    if @blog_item.update(security_params)
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 8]]
UPDATE "articles" SET "text" = ?, "title" = ?, "updated_at" = ? WHERE "articles"."id" = 8  [["text", "lalalala"], ["title", "Teste Update"], ["updated_at", "2014-05-19 19:04:15.721059"]]

  def index
    @blog_item = Article.all
---
SELECT "articles".* FROM "articles"

  def destroy
    @blog_item = Article.find(params[:id])
    @blog_item.destroy
---
SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 13]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 13]]