app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("article_id", "body", "commenter", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["article_id", 1], ["body", "Achei irado esse post!"], ["commenter", "Marcelo Menezes"], ["created_at", "2014-05-20 16:54:45.586715"], ["updated_at", "2014-05-20 16:54:45.586715"]]
---
  def create
    @blog_item = Article.find(params[:article_id])
    @comment = @blog_item.comments.create(comment_params)

SELECT  "articles".* FROM "articles"  WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "comments".* FROM "comments"  WHERE "comments"."article_id" = ? AND "comments"."id" = ? LIMIT 1  [["article_id", 1], ["id", 2]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 2]]
---
  def destroy
    @blog_item = Article.find(params[:article_id])
    @comment = @blog_item.comments.find(params[:id])
    @comment.destroy